Revit 2027 API
TextNoteOptions.KeepRotatedTextReadable Property
 Flag controling whether a rotate text is to stay oriented to be always readable.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool KeepRotatedTextReadable { get; set; }
Public Property KeepRotatedTextReadable As Boolean
	Get
	Set
public:
property bool KeepRotatedTextReadable {
	bool get ();
	void set (bool value);
}
member KeepRotatedTextReadable : bool with get, set
Property Value
Boolean
Remarks
 Default value is True.
See Also
Reference
TextNoteOptions Class
Autodesk.Revit.DB Namespace